Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыОснПродавцом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияАнализовПоМедКнижке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промоутер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорпоративнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорпоративныеБанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнештатныйСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьВнештатника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитСкладу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяИнициаторомЗаявокНаРасходДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБонусаПомощникаУправляющего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗуп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Информация для помошника управляющего (Откуда сотрудник будет ехать на подработку)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомощникТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КабинетРассылкиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РоумингТолькоСвоиЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПсихологОсв</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникТилси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуперпользовательТехбота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноЗанятый</Name>
					<Comment>Признак назначается физ. лицам, с неполной занятостью (студентам пр.) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВахтыВГрафике</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВахтГрафикиРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПройденныеТренинги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тренинг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрохождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТренингПройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиСПравомАкцептаОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиСПравомАкцептаОплат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРассылкиЗаявкиНаУслугиИМатериалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРассылокЗаявкиНаУслугиИМатериалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоАвансам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФизическиеЛица/Ext/ObjectModule.bsl
Перем ВыполнятьРассылкуОбИзмененииФИО Экспорт;
Перем ФиоИзменили;
Перем БылоФИО;


Процедура ПередЗаписью(Отказ)
	
	ФиоИзменили = Ложь;
	Если НЕ ЭтоНовый() Тогда
		БылоФИО = Ссылка.Наименование;
		Если БылоФИО <> Наименование Тогда
			ФиоИзменили = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЭтоНовый()
			И НЕ ОбменДанными.Загрузка Тогда
		УстановитьНовыйКод("0001");
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЭтотОбъект.Активный
				И ЭтотОбъект.Ссылка.Активный Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ФизЛицо", ЭтотОбъект.Ссылка);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПользователиСПравомАкцептаОплат.Ссылка
			|ИЗ
			|	Справочник.ПользователиСПравомАкцептаОплат КАК ПользователиСПравомАкцептаОплат
			|ГДЕ
			|	ПользователиСПравомАкцептаОплат.Активен
			|	И ПользователиСПравомАкцептаОплат.Пользователь.ФизЛицо = &ФизЛицо";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектСправочника.Активен = Ложь;
				ОбъектСправочника.Записать();
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	//+++АК LAGP 2018.10.02 ИП-00018521.01 Проверка физ.лица контрагента ЮрФизЛицо = ФизЛицо
	Если ЗначениеЗаполнено(Контрагент) И НЕ (ЗначениеЗаполнено(ДатаРождения) И ЗначениеЗаполнено(УдостоверениеЛичности)) Тогда
		Сообщить("Для физ. лица с заполненным полем ""Контрагент"", указание даты рождения и удостоверения личности обязательно!");	
		Отказ = Истина;
	КонецЕсли;	
	//---АК LAGP
	
	//+++АК mika 2018.10.11 ИП-00019964
	Если НЕ Отказ И НЕ ЭтоНовый() И ЗначениеЗаполнено(ПомощникТУ)Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбновитьГруппуСотрудника");
	КонецЕсли;
	//---АК mika
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если НЕ ОбменДанными.Загрузка Тогда
		НомерКПроверке = СокрЛП(Код);
		СтрокаРазрешенные = "0123456789";
		Для н = 1 По СтрДлина(НомерКПроверке) Цикл
			Если Найти(СтрокаРазрешенные, Сред(НомерКПроверке, н, 1)) = 0 Тогда
				Сообщить("Код элемент физ лиц " + Наименование + " не должен содержать символы кроме цифр");
				Отказ = Истина;
			КонецЕсли;	
		КонецЦикла;	
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//+++АК mika 2018.10.11 ИП-00019964
	Если НЕ Отказ И ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновитьГруппуСотрудника") Тогда
		ПостроениеГрафиковСервер.ОбновитьГруппуСотрудникаПоНовомуПомощнику(,,Ссылка, ПомощникТУ);
	КонецЕсли;
	//---АК mika

	//Если НЕ Отказ
	//		И ВыполнятьРассылкуОбИзмененииФИО
	//		И ФиоИзменили Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	//	Запрос.УстановитьПараметр("ФизЛицо", ЭтотОбъект.Ссылка);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЕСТЬNULL(ПомощникиУправляющихВТорговыхТочкахСрезПоследних.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Помощник,
	//	|	ЕСТЬNULL(ПользователиПоЦФОСрезПоследних.Сотрудник, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Управляющий
	//	|ПОМЕСТИТЬ ВТ_Работники
	//	|ИЗ
	//	|	РегистрСведений.ТабельРаботыПродавцов.СрезПоследних(
	//	|			&ТекДата,
	//	|			Сотрудник = &ФизЛицо
	//	|				И Отсутствие = ЗНАЧЕНИЕ(Перечисление.ВидыОтсутствия.ПустаяСсылка)) КАК ТабельРаботыПродавцовСрезПоследних
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПомощникиУправляющихВТорговыхТочках.СрезПоследних(&ТекДата, ) КАК ПомощникиУправляющихВТорговыхТочкахСрезПоследних
	//	|		ПО ТабельРаботыПродавцовСрезПоследних.ТорговаяТочка = ПомощникиУправляющихВТорговыхТочкахСрезПоследних.СтруктурнаяЕдиница
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиПоЦФО.СрезПоследних(&ТекДата, ) КАК ПользователиПоЦФОСрезПоследних
	//	|		ПО (ТабельРаботыПродавцовСрезПоследних.Группа = ПользователиПоЦФОСрезПоследних.ЦФО
	//	|				И ПользователиПоЦФОСрезПоследних.РуководительОтдела = ИСТИНА)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(150)) КАК Мейл
	//	|ИЗ
	//	|	ВТ_Работники КАК ВТ_Работники
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//	|		ПО ВТ_Работники.Помощник = КонтактнаяИнформация.Объект
	//	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	//	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица))
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(150)) КАК Мейл
	//	|ИЗ
	//	|	ВТ_Работники КАК ВТ_Работники
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//	|		ПО ВТ_Работники.Управляющий = КонтактнаяИнформация.Объект
	//	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	//	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица))";
	//				   
	//	Результаты = Запрос.ВыполнитьПакет();
	//	МассивПолучатели = Новый Массив();
	//	Выборка = Результаты[1].Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Если ЗначениеЗаполнено(Выборка.Мейл) Тогда
	//			МассивПолучатели.Добавить(СокрЛП(Выборка.Мейл));
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//	Выборка = Результаты[2].Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Если ЗначениеЗаполнено(Выборка.Мейл) Тогда
	//			МассивПолучатели.Добавить(СокрЛП(Выборка.Мейл));
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//	Попытка
	//		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001");
	//		Если МассивПолучатели.Количество() > 0 Тогда
	//			Почта = Новый ИнтернетПочта;
	//			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	//			Письмо = Новый ИнтернетПочтовоеСообщение;
	//			
	//			Почта.Подключиться(Профиль);
	//			Письмо.Тема = "Изменено ФИО сотрудника";
	//			Письмо.ИмяОтправителя = ""+УчетнаяЗапись+"";
	//			Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
	//			Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
	//			Для Каждого ПолучательЭлемент Из МассивПолучатели Цикл
	//				Получатель = Письмо.Получатели.Добавить();
	//				Получатель.Адрес           = ПолучательЭлемент;
	//			КонецЦикла;	
	//			
	//			ТекстСообщения = Письмо.Тексты.Добавить();
	//			ТекстСообщения.Текст     = "Фамилия сотрудника <" + БылоФИО + "> была изменена на <" + Наименование + ">";
	//			ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	//			
	//			Если НЕ ОбщегоНазначения.ЭтоКопияБазы() Тогда
	//				Почта.Послать(Письмо);
	//			КонецЕсли;	
	//			Почта.Отключиться();
	//		КонецЕсли;
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//	КонецПопытки;	
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УинВЗуп = "";
	
КонецПроцедуры


ВыполнятьРассылкуОбИзмененииФИО = Истина;
